app/controllers/plans_controller.rb

  def create
    @plan = Plan.new(plan_params)

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "plan1"], ["created_at", "2021-04-06 18:34:48.190930"], ["updated_at", "2021-04-06 18:34:48.190930"]]

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]